import pandas as pd

data_1 = { 'Набор А': [85, 90, 95, 100, 105],
         'Набор Б': [70, 80, 95, 110, 120],
        }

df_1 = pd.DataFrame(data_1)

stdA = df_1['Набор А'].std()
stdB = df_1['Набор Б'].std()

print(f'Стандартное отклонение набор 1 : {stdA}')
print(f'Стандартное отклонение набор 2 : {stdB}')



data_2 = {'Возраст': [23, 22, 21, 27, 23, 20, 29, 28, 22, 25],
        'Зарплата': [54000, 58000, 60000, 52000, 55000, 59000, 51000, 49000, 53000, 61000],
        }

df_2 = pd.DataFrame(data_2)
print(df_2.describe())

print(f"Средний возраст - {df_2['Возраст'].mean()}")
print(f"Медианный возраст - {df_2['Возраст'].median()}")
print(f"Стандартное отклонение возраста -{df_2['Возраст'].std()}")

print(f"Средняя зарплата - {df_2['Зарплата'].mean()}")
print(f"Медианная зп - {df_2['Зарплата'].median()}")
print(f"Стандартное отклонение зп - {df_2['Зарплата'].std()}")





